const MIN_YEAR = 1960;
const MAX_YEAR = 2040;

let cur = new Date();

const MONTHS = [
  "Jan","Feb","Mar","Apr","May","Jun",
  "Jul","Aug","Sep","Oct","Nov","Dec"
];

const BANGLA_MONTHS = [
  "বৈশাখ","জ্যৈষ্ঠ","আষাঢ়","শ্রাবণ","ভাদ্র","আশ্বিন",
  "কার্তিক","অগ্রহায়ণ","পৌষ","মাঘ","ফাল্গুন","চৈত্র"
];

const FESTIVALS = {
  "2025-12-25":"Christmas 🎄",
  "2025-12-31":"New Year Eve 🎆",

  /* ===== 2024 ===== */
  "2024-10-09": "Durga Puja – ষষ্ঠী 🪔",
  "2024-10-10": "Durga Puja – সপ্তমী 🪔",
  "2024-10-11": "Durga Puja – অষ্টমী 🪔",
  "2024-10-12": "Durga Puja – নবমী 🪔",
  "2024-10-13": "Durga Puja – বিজয়া দশমী 🌸",
  "2024-10-31": "Kali Puja 🕯️ / Lakshmi Puja 🪔",

  /* ===== 2025 ===== */
  "2025-09-28": "Durga Puja – ষষ্ঠী 🪔",
  "2025-09-29": "Durga Puja – সপ্তমী 🪔",
  "2025-09-30": "Durga Puja – অষ্টমী 🪔",
  "2025-10-01": "Durga Puja – নবমী 🪔",
  "2025-10-02": "Durga Puja – বিজয়া দশমী 🌸",
  "2025-10-20": "Kali Puja 🕯️ / Lakshmi Puja 🪔",

  /* ===== 2026 ===== */
  "2026-10-17": "Durga Puja – ষষ্ঠী 🪔",
  "2026-10-18": "Durga Puja – সপ্তমী 🪔",
  "2026-10-19": "Durga Puja – অষ্টমী 🪔",
  "2026-10-20": "Durga Puja – নবমী 🪔",
  "2026-10-21": "Durga Puja – বিজয়া দশমী 🌸",
  "2026-11-08": "Kali Puja 🕯️ / Lakshmi Puja 🪔",

  /* ===== 2027 ===== */
  "2027-10-05": "Durga Puja – ষষ্ঠী 🪔",
  "2027-10-06": "Durga Puja – সপ্তমী 🪔",
  "2027-10-07": "Durga Puja – অষ্টমী 🪔",
  "2027-10-08": "Durga Puja – নবমী 🪔",
  "2027-10-10": "Durga Puja – বিজয়া দশমী 🌸",
  "2027-10-28": "Kali Puja 🕯️ / Lakshmi Puja 🪔",

  /* ===== 2028 ===== */
  "2028-09-24": "Durga Puja – ষষ্ঠী 🪔",
  "2028-09-25": "Durga Puja – সপ্তমী 🪔",
  "2028-09-26": "Durga Puja – অষ্টমী 🪔",
  "2028-09-27": "Durga Puja – নবমী 🪔",
  "2028-09-28": "Durga Puja – বিজয়া দশমী 🌸",
  "2028-10-17": "Kali Puja 🕯️ / Lakshmi Puja 🪔",

  /* ===== 2029 ===== */
  "2029-10-14": "Durga Puja – ষষ্ঠী 🪔",
  "2029-10-15": "Durga Puja – সপ্তমী 🪔",
  "2029-10-16": "Durga Puja – অষ্টমী 🪔",
  "2029-10-17": "Durga Puja – নবমী 🪔",
  "2029-10-18": "Durga Puja – বিজয়া দশমী 🌸",
  "2029-11-05": "Kali Puja 🕯️ / Lakshmi Puja 🪔",

  /* ===== 2030 ===== */
  "2030-10-02": "Durga Puja – ষষ্ঠী 🪔",
  "2030-10-03": "Durga Puja – সপ্তমী 🪔",
  "2030-10-04": "Durga Puja – অষ্টমী 🪔",
  "2030-10-05": "Durga Puja – নবমী 🪔",
  "2030-10-06": "Durga Puja – বিজয়া দশমী 🌸",
  "2030-10-26": "Kali Puja 🕯️ / Lakshmi Puja 🪔"

};
